Levi-5k/ESP32_P4_SLAM/main/camera_init.c
/*
 * Camera initialization for ESP32-P4-WIFI6 with OV5647 MIPI-CSI
 * Based on official ESP-IDF mipi_isp_dsi example and GitHub issue #15409
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_log.h"
#include "esp_err.h"
#include "esp_cam_ctlr_csi.h"
#include "esp_cam_ctlr.h"
#include "driver/i2c_master.h"
#include "driver/isp.h"
#include "esp_ldo_regulator.h"
#include "esp_heap_caps.h"
#include "esp_system.h"
#include "esp_cache.h"
#include "example_sensor_init.h"
#include "camera_init.h"
#include "esp32p4_pin_config.h"

static const char *TAG = "camera_init";

// OV5647 MIPI-CSI Configuration for ESP32-P4-WIFI6 (using centralized pin config)
#define CAMERA_LANE_BITRATE_MBPS    200    // MIPI lane bitrate
#define CAMERA_DATA_LANES           2      // OV5647 uses 2 data lanes

// Camera resolution settings (using standard OV5647 format)
#define CAMERA_WIDTH               800     // OV5647 standard width
#define CAMERA_HEIGHT              640     // OV5647 standard height

// MIPI LDO configuration for ESP32-P4 camera power
#define MIPI_LDO_CHANNEL_ID         3      // LDO channel 3 for MIPI PHY
#define MIPI_LDO_VOLTAGE_MV         2500   // 2.5V for MIPI DPHY

// RGB565 frame configuration
#define RGB565_BITS_PER_PIXEL       16

static esp_cam_ctlr_handle_t s_cam_handle = NULL;
static example_sensor_handle_t s_sensor_handle = {0};
static esp_ldo_channel_handle_t s_ldo_mipi_phy = NULL;
static isp_proc_handle_t s_isp_proc = NULL;
static void *s_frame_buffer = NULL;
static size_t s_frame_buffer_size = 0;
static size_t s_frame_size = 0;  // Size of the current captured frame
static uint32_t s_finished_trans_counter = 0;

// Continuous capture management
static void *s_frame_buffer_1 = NULL;
static void *s_frame_buffer_2 = NULL;
static esp_cam_ctlr_trans_t s_new_trans_1;
static esp_cam_ctlr_trans_t s_new_trans_2;
static volatile bool s_continuous_capture_running = false;
static volatile void *s_latest_frame_buffer = NULL;  // Pointer to latest captured frame
static volatile size_t s_latest_frame_size = 0;     // Size of latest captured frame

// Global ISP color state to preserve all settings
static esp_isp_color_config_t s_current_color_config = {
    .color_contrast = {
        .integer = 1,
        .decimal = 0,
    },
    .color_saturation = {
        .integer = 1,
        .decimal = 0,
    },
    .color_hue = 0,
    .color_brightness = 0,
};

// Camera controller callback functions (based on ESP-IDF examples)
static bool IRAM_ATTR s_camera_get_new_vb(esp_cam_ctlr_handle_t handle, esp_cam_ctlr_trans_t *trans, void *user_data)
{
    static bool use_buffer_1 = true;
    
    if (s_continuous_capture_running) {
        if (use_buffer_1 && s_frame_buffer_1) {
            trans->buffer = s_frame_buffer_1;
            trans->buflen = s_frame_buffer_size;
            use_buffer_1 = false;
        } else if (s_frame_buffer_2) {
            trans->buffer = s_frame_buffer_2;
            trans->buflen = s_frame_buffer_size;
            use_buffer_1 = true;
        } else {
            trans->buffer = s_frame_buffer;
            trans->buflen = s_frame_buffer_size;
        }
        // Disable logging completely to prevent watchdog timeout
        // if (s_finished_trans_counter % 1000 == 0) {
        //     ESP_DRAM_LOGI(TAG, "s_camera_get_new_vb: assigned buffer %p (frame %lu)", trans->buffer, s_finished_trans_counter);
        // }
        return true;
    }
    
    // Fallback to main buffer
    trans->buffer = s_frame_buffer;
    trans->buflen = s_frame_buffer_size;
    return true;
}

static bool IRAM_ATTR s_camera_get_finished_trans(esp_cam_ctlr_handle_t handle, esp_cam_ctlr_trans_t *trans, void *user_data)
{
    s_finished_trans_counter++;
    
    // Instead of copying the entire frame, just update the pointer and size
    // This is much faster and won't cause watchdog timeouts
    s_latest_frame_buffer = trans->buffer;
    s_latest_frame_size = trans->buflen;
    s_frame_size = trans->buflen;
    
    // Return false to recycle buffer for continuous capture
    return false;
}

esp_err_t camera_init(void)
{
    esp_err_t ret = ESP_OK;
    
    ESP_LOGI(TAG, "=== ESP32-P4 OV5647 MIPI-CSI Camera Initialization ===");
    ESP_LOGI(TAG, "Free heap before camera init: %lu bytes", esp_get_free_heap_size());
    
    // Step 1: Configure MIPI LDO power for ESP32-P4 camera
    ESP_LOGI(TAG, "Configuring MIPI LDO power...");
    esp_ldo_channel_config_t ldo_mipi_phy_config = {
        .chan_id = MIPI_LDO_CHANNEL_ID,
        .voltage_mv = MIPI_LDO_VOLTAGE_MV,
    };
    ret = esp_ldo_acquire_channel(&ldo_mipi_phy_config, &s_ldo_mipi_phy);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to acquire MIPI LDO channel: %s", esp_err_to_name(ret));
        return ret;
    }
    ESP_LOGI(TAG, "✅ MIPI LDO configured: Channel %d at %dmV", MIPI_LDO_CHANNEL_ID, MIPI_LDO_VOLTAGE_MV);
    
    // Step 2: Calculate frame buffer size and allocate memory
    s_frame_buffer_size = CAMERA_WIDTH * CAMERA_HEIGHT * RGB565_BITS_PER_PIXEL / 8;
    ESP_LOGI(TAG, "Frame buffer size needed: %zu bytes (%.1f KB)", s_frame_buffer_size, s_frame_buffer_size / 1024.0);
    ESP_LOGI(TAG, "Resolution: %dx%d RGB565", CAMERA_WIDTH, CAMERA_HEIGHT);
    
    // Memory allocation with proper cache alignment (based on ESP-IDF examples)
    size_t frame_buffer_alignment = 64;  // Use standard cache line size for ESP32-P4
    ESP_LOGI(TAG, "Cache alignment: %zu bytes", frame_buffer_alignment);
    
    // Try PSRAM first, then internal RAM (following ESP-IDF test examples)
    s_frame_buffer = heap_caps_aligned_calloc(frame_buffer_alignment, 1, s_frame_buffer_size,
                                              MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (s_frame_buffer) {
        ESP_LOGI(TAG, "✅ Frame buffer allocated in PSRAM: %zu bytes at %p", s_frame_buffer_size, s_frame_buffer);
    } else {
        ESP_LOGE(TAG, "❌ Frame buffer allocation failed in PSRAM");
        esp_ldo_release_channel(s_ldo_mipi_phy);
        return ESP_ERR_NO_MEM;
    }
    
    // Allocate additional buffers for continuous capture ping-pong mechanism
    s_frame_buffer_1 = heap_caps_aligned_calloc(frame_buffer_alignment, 1, s_frame_buffer_size,
                                                MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    s_frame_buffer_2 = heap_caps_aligned_calloc(frame_buffer_alignment, 1, s_frame_buffer_size,
                                                MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    
    if (s_frame_buffer_1 && s_frame_buffer_2) {
        ESP_LOGI(TAG, "✅ Continuous capture buffers allocated: %p, %p", s_frame_buffer_1, s_frame_buffer_2);
    } else {
        ESP_LOGW(TAG, "⚠️ Continuous capture buffers allocation failed, using single buffer mode");
        if (s_frame_buffer_1) heap_caps_free(s_frame_buffer_1);
        if (s_frame_buffer_2) heap_caps_free(s_frame_buffer_2);
        s_frame_buffer_1 = NULL;
        s_frame_buffer_2 = NULL;
    }
    
