Levi-5k/ESP32_P4_SLAM/main/camera_init.c
    // Prepare transaction data structure
    esp_cam_ctlr_trans_t new_trans = {
        .buffer = s_frame_buffer,
        .buflen = s_frame_buffer_size,
    };
    
    // Step 3: Initialize camera sensor using ESP-IDF example_sensor_init
    ESP_LOGI(TAG, "Initializing OV5647 camera sensor...");
    example_sensor_config_t cam_sensor_config = {
        .i2c_port_num = I2C_NUM_0,
        .i2c_sda_io_num = CAMERA_I2C_SDA_IO,
        .i2c_scl_io_num = CAMERA_I2C_SCL_IO,
        .port = ESP_CAM_SENSOR_MIPI_CSI,
        .format_name = "MIPI_2lane_24Minput_RAW8_800x640_50fps",
    };
    
    example_sensor_init(&cam_sensor_config, &s_sensor_handle);
    if (s_sensor_handle.sccb_handle == NULL || s_sensor_handle.i2c_bus_handle == NULL) {
        ESP_LOGE(TAG, "❌ Camera sensor initialization failed");
        heap_caps_free(s_frame_buffer);
        esp_ldo_release_channel(s_ldo_mipi_phy);
        return ESP_FAIL;
    }
    ESP_LOGI(TAG, "✅ OV5647 sensor initialized successfully");
    
    // Step 4: Initialize ISP (Image Signal Processor) BEFORE camera controller
    ESP_LOGI(TAG, "Initializing ISP processor...");
    esp_isp_processor_cfg_t isp_config = {
        .clk_hz = 80 * 1000 * 1000,
        .input_data_source = ISP_INPUT_DATA_SOURCE_CSI,
        .input_data_color_type = ISP_COLOR_RAW8,
        .output_data_color_type = ISP_COLOR_RGB565,
        .has_line_start_packet = false,
        .has_line_end_packet = false,
        .h_res = CAMERA_WIDTH,
        .v_res = CAMERA_HEIGHT,
    };
    ret = esp_isp_new_processor(&isp_config, &s_isp_proc);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to create ISP processor: %s", esp_err_to_name(ret));
        example_sensor_deinit(s_sensor_handle);
        heap_caps_free(s_frame_buffer);
        esp_ldo_release_channel(s_ldo_mipi_phy);
        return ret;
    }
    
    ret = esp_isp_enable(s_isp_proc);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to enable ISP processor: %s", esp_err_to_name(ret));
        esp_isp_del_processor(s_isp_proc);
        example_sensor_deinit(s_sensor_handle);
        heap_caps_free(s_frame_buffer);
        esp_ldo_release_channel(s_ldo_mipi_phy);
        return ret;
    }
    ESP_LOGI(TAG, "✅ ISP processor initialized and enabled");
    
    // Step 4a: Initialize and enable ISP color controller
    ESP_LOGI(TAG, "Initializing ISP color controller...");
    ret = esp_isp_color_configure(s_isp_proc, &s_current_color_config);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to configure ISP color: %s", esp_err_to_name(ret));
        esp_isp_del_processor(s_isp_proc);
        example_sensor_deinit(s_sensor_handle);
        heap_caps_free(s_frame_buffer);
        esp_ldo_release_channel(s_ldo_mipi_phy);
        return ret;
    }
    
    ret = esp_isp_color_enable(s_isp_proc);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to enable ISP color: %s", esp_err_to_name(ret));
        esp_isp_del_processor(s_isp_proc);
        example_sensor_deinit(s_sensor_handle);
        heap_caps_free(s_frame_buffer);
        esp_ldo_release_channel(s_ldo_mipi_phy);
        return ret;
    }
    ESP_LOGI(TAG, "✅ ISP color controller enabled");
    
    // Step 5: Configure MIPI-CSI camera controller (connecting to ISP)
    ESP_LOGI(TAG, "Configuring CSI controller to connect with ISP...");
    esp_cam_ctlr_csi_config_t csi_config = {
        .ctlr_id = 0,
        .h_res = CAMERA_WIDTH,
        .v_res = CAMERA_HEIGHT,
        .lane_bit_rate_mbps = CAMERA_LANE_BITRATE_MBPS,
        .input_data_color_type = CAM_CTLR_COLOR_RAW8,
        .output_data_color_type = CAM_CTLR_COLOR_RAW8,  // Output RAW8 to ISP
        .data_lane_num = CAMERA_DATA_LANES,
        .byte_swap_en = false,
        .queue_items = 4,  // Increase queue size for continuous capture
    };
    
    ret = esp_cam_new_csi_ctlr(&csi_config, &s_cam_handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to create CSI controller: %s", esp_err_to_name(ret));
        esp_isp_del_processor(s_isp_proc);
        example_sensor_deinit(s_sensor_handle);
        heap_caps_free(s_frame_buffer);
        esp_ldo_release_channel(s_ldo_mipi_phy);
        return ret;
    }
    
    ESP_LOGI(TAG, "✅ Camera controller created");
    
    // Step 6: Register camera event callbacks (critical for frame capture)
    esp_cam_ctlr_evt_cbs_t cbs = {
        .on_get_new_trans = s_camera_get_new_vb,
        .on_trans_finished = s_camera_get_finished_trans,
    };
    ret = esp_cam_ctlr_register_event_callbacks(s_cam_handle, &cbs, &new_trans);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register camera callbacks: %s", esp_err_to_name(ret));
        esp_cam_ctlr_del(s_cam_handle);
        example_sensor_deinit(s_sensor_handle);
        heap_caps_free(s_frame_buffer);
        esp_ldo_release_channel(s_ldo_mipi_phy);
        return ret;
    }
    ESP_LOGI(TAG, "✅ Camera callbacks registered");
    
    // Step 7: Enable camera controller
    ret = esp_cam_ctlr_enable(s_cam_handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to enable camera controller: %s", esp_err_to_name(ret));
        return ret;
    }
    ESP_LOGI(TAG, "✅ Camera controller enabled");
    
    // Don't initialize frame buffer to white - let real camera data fill it
    // memset(s_frame_buffer, 0xFF, s_frame_buffer_size);
    
    // Cache sync for DMA (critical for ESP32-P4)
    esp_cache_msync(s_frame_buffer, s_frame_buffer_size, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
    
    ESP_LOGI(TAG, "🎉 Camera initialization completed successfully!");
    ESP_LOGI(TAG, "📷 OV5647 MIPI-CSI: %dx%d, %d lanes, %d Mbps", 
             CAMERA_WIDTH, CAMERA_HEIGHT, CAMERA_DATA_LANES, CAMERA_LANE_BITRATE_MBPS);
    ESP_LOGI(TAG, "💾 Frame buffer: %zu bytes @ %p", s_frame_buffer_size, s_frame_buffer);
    ESP_LOGI(TAG, "Free heap after init: %lu bytes", esp_get_free_heap_size());
    
    return ESP_OK;
}

esp_err_t camera_start(void)
{
    if (s_cam_handle == NULL) {
        ESP_LOGE(TAG, "Camera not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
