Levi-5k/ESP32_P4_SLAM/main/camera_init.c
    ESP_LOGI(TAG, "Starting camera capture...");
    
    // Start camera controller (based on working examples)
    esp_err_t ret = esp_cam_ctlr_start(s_cam_handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start camera: %s", esp_err_to_name(ret));
        return ret;
    }
    
    // Start sensor streaming now that everything is initialized
    ESP_LOGI(TAG, "Starting sensor streaming...");
    if (s_sensor_handle.sensor_device) {
        int enable_stream = 1;
        esp_err_t stream_ret = esp_cam_sensor_ioctl(s_sensor_handle.sensor_device, ESP_CAM_SENSOR_IOC_S_STREAM, &enable_stream);
        if (stream_ret == ESP_OK) {
            ESP_LOGI(TAG, "✅ Sensor streaming enabled successfully");
            
            // Give sensor time to start producing data (critical for OV5647)
            vTaskDelay(100 / portTICK_PERIOD_MS);
            ESP_LOGI(TAG, "Sensor stabilization delay completed");
        } else {
            ESP_LOGE(TAG, "❌ Failed to enable sensor streaming: %s", esp_err_to_name(stream_ret));
            return stream_ret;
        }
    } else {
        ESP_LOGE(TAG, "❌ Sensor device handle is NULL");
        return ESP_ERR_INVALID_STATE;
    }
    
    // Enable continuous capture mode
    s_continuous_capture_running = true;
    
    // Start with a single blocking receive to test if sensor is actually streaming
    esp_cam_ctlr_trans_t test_trans = {
        .buffer = s_frame_buffer,
        .buflen = s_frame_buffer_size,
    };
    
    ESP_LOGI(TAG, "Testing sensor data flow with blocking receive...");
    ret = esp_cam_ctlr_receive(s_cam_handle, &test_trans, 500 / portTICK_PERIOD_MS);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ Sensor is streaming data - first frame received!");
        
        // Check if we got real data or just zeros
        uint16_t *pixel_data = (uint16_t *)test_trans.buffer;
        bool has_data = false;
        for (int i = 0; i < 100; i++) {
            if (pixel_data[i] != 0) {
                has_data = true;
                break;
            }
        }
        
        if (has_data) {
            ESP_LOGI(TAG, "✅ Frame contains real image data");
        } else {
            ESP_LOGW(TAG, "⚠️ Frame contains only zeros - sensor may need more time");
        }
        
        // Now start continuous capture with callback-driven ping-pong buffers
        if (s_frame_buffer_1 && s_frame_buffer_2) {
            s_new_trans_1.buffer = s_frame_buffer_1;
            s_new_trans_1.buflen = s_frame_buffer_size;
            s_new_trans_2.buffer = s_frame_buffer_2;
            s_new_trans_2.buflen = s_frame_buffer_size;
            
            // Queue transactions with no timeout (non-blocking)
            ret = esp_cam_ctlr_receive(s_cam_handle, &s_new_trans_1, 0);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "✅ Continuous capture transaction 1 queued");
            } else {
                ESP_LOGW(TAG, "⚠️ Failed to queue transaction 1: %s", esp_err_to_name(ret));
            }
            
            ret = esp_cam_ctlr_receive(s_cam_handle, &s_new_trans_2, 0);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "✅ Continuous capture transaction 2 queued");
            } else {
                ESP_LOGW(TAG, "⚠️ Failed to queue transaction 2: %s", esp_err_to_name(ret));
            }
        }
    } else {
        ESP_LOGE(TAG, "❌ Sensor is NOT streaming data: %s", esp_err_to_name(ret));
        ESP_LOGE(TAG, "This means the sensor is not actually transmitting data over MIPI-CSI");
        return ret;
    }
    
    ESP_LOGI(TAG, "📸 Camera started successfully - continuous capture mode enabled");
    return ESP_OK;
}

esp_err_t camera_capture(uint8_t **buffer, size_t *len)
{
    if (s_cam_handle == NULL || s_frame_buffer == NULL) {
        ESP_LOGE(TAG, "Camera not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (!s_continuous_capture_running) {
        ESP_LOGW(TAG, "Continuous capture not running");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (s_latest_frame_buffer == NULL || s_latest_frame_size == 0) {
        ESP_LOGW(TAG, "No frame captured yet");
        return ESP_ERR_NOT_FOUND;
    }
    
    // Return pointer to the latest captured frame (no copy needed!)
    *buffer = (uint8_t *)s_latest_frame_buffer;
    *len = s_latest_frame_size;
    
    ESP_LOGI(TAG, "📸 Frame from continuous capture: %zu bytes (frame count: %lu)", *len, s_finished_trans_counter);
    
    return ESP_OK;
}

void camera_deinit(void)
{
    ESP_LOGI(TAG, "Deinitializing camera...");
    
    // Stop continuous capture
    s_continuous_capture_running = false;
    
    if (s_cam_handle) {
        esp_cam_ctlr_stop(s_cam_handle);
        esp_cam_ctlr_disable(s_cam_handle);
        esp_cam_ctlr_del(s_cam_handle);
        s_cam_handle = NULL;
        ESP_LOGI(TAG, "Camera controller stopped and released");
    }
    
    if (s_isp_proc) {
        esp_isp_disable(s_isp_proc);
        esp_isp_del_processor(s_isp_proc);
        s_isp_proc = NULL;
        ESP_LOGI(TAG, "ISP processor stopped and released");
    }
    
    example_sensor_deinit(s_sensor_handle);
    ESP_LOGI(TAG, "Camera sensor deinitialized");
    
    // Release frame buffers
    if (s_frame_buffer) {
        heap_caps_free(s_frame_buffer);
        s_frame_buffer = NULL;
        ESP_LOGI(TAG, "Main frame buffer released");
    }
    
    if (s_frame_buffer_1) {
        heap_caps_free(s_frame_buffer_1);
        s_frame_buffer_1 = NULL;
        ESP_LOGI(TAG, "Continuous capture buffer 1 released");
    }
    
    if (s_frame_buffer_2) {
        heap_caps_free(s_frame_buffer_2);
        s_frame_buffer_2 = NULL;
        ESP_LOGI(TAG, "Continuous capture buffer 2 released");
    }
    
    // Release MIPI LDO channel
    if (s_ldo_mipi_phy) {
        esp_ldo_release_channel(s_ldo_mipi_phy);
        s_ldo_mipi_phy = NULL;
        ESP_LOGI(TAG, "MIPI LDO released");
    }
    
    ESP_LOGI(TAG, "Camera deinitialization completed");
}

size_t camera_get_frame_size(void)
{
    return s_frame_size;
}

// Camera control functions for adjusting image parameters using ESP32-P4 ISP
esp_err_t camera_set_brightness(int brightness)
{
    ESP_LOGI(TAG, "🔆 Setting camera brightness to: %d", brightness);
    
    if (!s_isp_proc) {
        ESP_LOGE(TAG, "❌ ISP processor not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    // ESP32-P4 ISP brightness range: -128 to 127
    int isp_brightness = (brightness - 50) * 255 / 100;  // Convert 0-100 to -127 to 128
    if (isp_brightness < -128) isp_brightness = -128;
    if (isp_brightness > 127) isp_brightness = 127;
    
