Levi-5k/ESP32_P4_SLAM/main/camera_init.c
    // Update global state
    s_current_color_config.color_brightness = isp_brightness;
    
    esp_err_t ret = esp_isp_color_configure(s_isp_proc, &s_current_color_config);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ Camera brightness set successfully (ISP value: %d)", isp_brightness);
    } else {
        ESP_LOGE(TAG, "❌ Failed to set camera brightness: %s", esp_err_to_name(ret));
    }
    
    return ret;
}

esp_err_t camera_set_contrast(int contrast)
{
    ESP_LOGI(TAG, "🎨 Setting camera contrast to: %d", contrast);
    
    if (!s_isp_proc) {
        ESP_LOGE(TAG, "❌ ISP processor not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    // ESP32-P4 ISP contrast range: 0.0 to 1.0, convert 0-100 to 0.0-2.0
    float contrast_float = (float)contrast / 50.0f;  // 50% = 1.0 (normal)
    if (contrast_float > 2.0f) contrast_float = 2.0f;
    if (contrast_float < 0.0f) contrast_float = 0.0f;
    
    // Update global state
    s_current_color_config.color_contrast.integer = (uint32_t)contrast_float;
    s_current_color_config.color_contrast.decimal = (uint32_t)((contrast_float - s_current_color_config.color_contrast.integer) * 127);
    
    esp_err_t ret = esp_isp_color_configure(s_isp_proc, &s_current_color_config);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ Camera contrast set successfully (ISP value: %.2f)", contrast_float);
    } else {
        ESP_LOGE(TAG, "❌ Failed to set camera contrast: %s", esp_err_to_name(ret));
    }
    
    return ret;
}

esp_err_t camera_set_saturation(int saturation)
{
    ESP_LOGI(TAG, "🌈 Setting camera saturation to: %d", saturation);
    
    if (!s_isp_proc) {
        ESP_LOGE(TAG, "❌ ISP processor not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    // ESP32-P4 ISP saturation range: 0.0 to 1.0, convert 0-100 to 0.0-2.0
    float saturation_float = (float)saturation / 50.0f;  // 50% = 1.0 (normal)
    if (saturation_float > 2.0f) saturation_float = 2.0f;
    if (saturation_float < 0.0f) saturation_float = 0.0f;
    
    // Update global state
    s_current_color_config.color_saturation.integer = (uint32_t)saturation_float;
    s_current_color_config.color_saturation.decimal = (uint32_t)((saturation_float - s_current_color_config.color_saturation.integer) * 127);
    
    esp_err_t ret = esp_isp_color_configure(s_isp_proc, &s_current_color_config);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ Camera saturation set successfully (ISP value: %.2f)", saturation_float);
    } else {
        ESP_LOGE(TAG, "❌ Failed to set camera saturation: %s", esp_err_to_name(ret));
    }
    
    return ret;
}

esp_err_t camera_set_exposure_mode(const char* mode)
{
    if (!mode) {
        return ESP_ERR_INVALID_ARG;
    }
    
    ESP_LOGI(TAG, "💡 Setting camera exposure mode to: %s", mode);
    
    // For ESP32-P4, exposure control through sensor IOCTL is limited
    // Most exposure control is handled automatically by the OV5647 sensor
    if (s_sensor_handle.sensor_device) {
        ESP_LOGI(TAG, "✅ Exposure mode '%s' acknowledged (sensor handles automatically)", mode);
        return ESP_OK;
    } else {
        ESP_LOGW(TAG, "⚠️ Sensor device not available for exposure control");
        return ESP_ERR_INVALID_STATE;
    }
}

esp_err_t camera_set_white_balance(const char* wb)
{
    if (!wb) {
        return ESP_ERR_INVALID_ARG;
    }
    
    ESP_LOGI(TAG, "⚪ Setting camera white balance to: %s", wb);
    
    // For ESP32-P4, white balance control through sensor IOCTL is limited
    // Most white balance control is handled automatically by the OV5647 sensor
    if (s_sensor_handle.sensor_device) {
        ESP_LOGI(TAG, "✅ White balance '%s' acknowledged (sensor handles automatically)", wb);
        return ESP_OK;
    } else {
        ESP_LOGW(TAG, "⚠️ Sensor device not available for white balance control");
        return ESP_ERR_INVALID_STATE;
    }
}

esp_err_t camera_auto_adjust(const uint8_t* frame_buffer, size_t frame_size)
{
    if (!frame_buffer || frame_size == 0) {
        ESP_LOGE(TAG, "Invalid frame buffer for auto-adjustment");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (!s_isp_proc) {
        ESP_LOGE(TAG, "ISP processor not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    ESP_LOGD(TAG, "🔧 Running automatic camera adjustment analysis...");
    
    // Analyze frame statistics for auto-adjustment
    uint32_t total_pixels = frame_size / 2; // RGB565 = 2 bytes per pixel
    uint32_t bright_pixels = 0;
    uint32_t dark_pixels = 0;
    uint32_t total_brightness = 0;
    uint32_t sample_count = 0;
    
    // Sample pixels for analysis (sample every 10th pixel for performance)
    const uint16_t* pixels = (const uint16_t*)frame_buffer;
    uint32_t sample_step = total_pixels / 1000; // Sample ~1000 pixels
    if (sample_step == 0) sample_step = 1;
    
    for (uint32_t i = 0; i < total_pixels; i += sample_step) {
        uint16_t pixel = pixels[i];
        
        // Extract RGB components from RGB565
        uint8_t r = (pixel >> 11) & 0x1F;
        uint8_t g = (pixel >> 5) & 0x3F;
        uint8_t b = pixel & 0x1F;
        
        // Convert to 8-bit and calculate brightness
        uint8_t r8 = (r << 3) | (r >> 2);
        uint8_t g8 = (g << 2) | (g >> 4);
        uint8_t b8 = (b << 3) | (b >> 2);
        
        uint8_t brightness = (uint8_t)((r8 * 0.299f + g8 * 0.587f + b8 * 0.114f));
        total_brightness += brightness;
        sample_count++;
        
        // Count bright/dark pixels
        if (brightness > 200) bright_pixels++;
        if (brightness < 50) dark_pixels++;
    }
    
    if (sample_count == 0) {
        ESP_LOGW(TAG, "⚠️ No pixels sampled for analysis");
        return ESP_ERR_INVALID_STATE;
    }
    
    float avg_brightness = (float)total_brightness / sample_count;
    float bright_ratio = (float)bright_pixels / sample_count;
    float dark_ratio = (float)dark_pixels / sample_count;
    
    ESP_LOGD(TAG, "📊 Frame analysis - Avg brightness: %.1f, Bright pixels: %.1f%%, Dark pixels: %.1f%%", 
             avg_brightness, bright_ratio * 100.0f, dark_ratio * 100.0f);
    
    // Auto-adjustment logic
    esp_err_t ret = ESP_OK;
    bool adjustment_made = false;
    
    // Brightness adjustment
    if (avg_brightness < 100.0f || avg_brightness > 150.0f) {
        int brightness_adjustment = (int)((128.0f - avg_brightness) * 0.5f);
        brightness_adjustment = (brightness_adjustment > 20) ? 20 : 
                               (brightness_adjustment < -20) ? -20 : brightness_adjustment;
        
        if (abs(brightness_adjustment) >= 5) {
            ret |= camera_set_brightness(brightness_adjustment);
            adjustment_made = true;
            ESP_LOGI(TAG, "🔆 Auto-adjusted brightness by %d (avg: %.1f)", 
                     brightness_adjustment, avg_brightness);
        }
    }
    
    // Contrast adjustment based on bright/dark pixel ratios
    if (bright_ratio > 0.3f || dark_ratio > 0.3f) {
        int contrast_adjustment = (bright_ratio > dark_ratio) ? -10 : 10;
        ret |= camera_set_contrast(contrast_adjustment);
        adjustment_made = true;
        ESP_LOGI(TAG, "🎨 Auto-adjusted contrast by %d (bright: %.1f%%, dark: %.1f%%)", 
                 contrast_adjustment, bright_ratio * 100.0f, dark_ratio * 100.0f);
    }
    
    // Saturation adjustment (slight boost for better color)
    if (bright_ratio < 0.1f && dark_ratio < 0.1f) {
        ret |= camera_set_saturation(10);
        adjustment_made = true;
        ESP_LOGI(TAG, "🌈 Auto-adjusted saturation +10 for better color");
    }
    
    if (!adjustment_made) {
        ESP_LOGD(TAG, "✅ No camera adjustments needed");
    }
    
    return ret;
}